In [1]:
# https://leetcode.com/problems/employee-bonus/description/?envType=study-plan-v2&envId=top-sql-50

In [1]:
import pandas as pd

# Create employee data
data = {'empId': [3, 1, 2, 4],
        'name': ['Brad', 'John', 'Dan', 'Thomas'],
        'supervisor': [None, 3, 3, 3],
        'salary': [4000, 1000, 2000, 4000]}

# Create the Employee DataFrame
df_employee = pd.DataFrame(data)

# Create bonus data
data = {'empId': [2, 4],
        'bonus': [500, 2000]}

# Create the Bonus DataFrame
df_bonus = pd.DataFrame(data)

In [2]:
df_bonus.head()

   empId  bonus
0      2    500
1      4   2000

In [3]:
df_employee.head()

   empId    name  supervisor  salary
0      3    Brad         NaN    4000
1      1    John         3.0    1000
2      2     Dan         3.0    2000
3      4  Thomas         3.0    4000

In [4]:
df_merge = pd.merge(df_employee, df_bonus, on="empId", how="left")
df_merge.head()

   empId    name  supervisor  salary   bonus
0      3    Brad         NaN    4000     NaN
1      1    John         3.0    1000     NaN
2      2     Dan         3.0    2000   500.0
3      4  Thomas         3.0    4000  2000.0

In [5]:
df_merge = df_merge[["name", "bonus"]]

In [6]:
df_result = df_merge[~(df_merge["bonus"] >= 1000)]
df_result.head()

   name  bonus
0  Brad    NaN
1  John    NaN
2   Dan  500.0

In [7]:
import pandas as pd

def employee_bonus(employee: pd.DataFrame, bonus: pd.DataFrame) -> pd.DataFrame:
    df_merge = pd.merge(employee, bonus, on="empId", how="left")
    df_merge = df_merge[["name", "bonus"]]
    df_result = df_merge[~(df_merge["bonus"] >= 1000)]
    return df_result

In [8]:
employee_bonus(df_employee, df_bonus)

   name  bonus
0  Brad    NaN
1  John    NaN
2   Dan  500.0